Revit 2024 API
ZoneEquipmentHvacType Enumeration
 The type of zone equipment.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public enum ZoneEquipmentHvacType
Visual Basic
Public Enumeration ZoneEquipmentHvacType
Visual C++
public enum class ZoneEquipmentHvacType
Members
Member name | Description
Undefined
ChilledBeamActive
FourPipeFanCoil
PackagedTerminalAirConditioner
PackagedTerminalHeatPump
ParallelFanPoweredBox
VAVBox
CAVBox
RadiantPanel
SeriesFanPoweredBox
UnitHeater
UnitVentilator
WaterSourceHeatPump
ChilledBeamPassive
Unconditioned
VRFFanCoil
See Also
Autodesk.Revit.DB.Mechanical Namespace